<h3>เกี่ยวกับ ACM-ICPC</h3>
<p>
    <b>ACM International Collegiate Programming Contest (ACM-ICPC)</b> เป็นการแข่งขันการเขียนโปรแกรมสำหรับอุดมศึกษาในระดับนานาชาติที่มีชื่อเสียงที่สุด โดยแต่ละทีมจะประกอบด้วยผู้แข่งขันสามคนและจะต้องเขียนโปรแกรมแก้ไขปัญหาทางวิทยาศาสตร์ คณิตศาสตร์ และอัลกอริทึม ภายในเวลาที่กำหนด จำนวนปัญหา 8-11 ข้อ ภายในเวลา 3 หรือ 5 ชั่วโมง โดยมีคอมพิวเตอร์หนึ่งเครื่อง ในประเทศไทยได้เริ่มมีการจัดการแข่งขันขึ้นครั้งแรกในปี ค.ศ. 2009 และในปีนี้ การแข่งขันที่จัดขึ้นในประเทศไทยประกอบด้วย
</p>
<ul>
    <li>การแข่งขันในระดับภูมิภาค</li>
    <ul>
        <li><b>ภาคเหนือ</b> วันที่ 4 กันยายน 2559 โดยมหาวิทยาลัยเชียงใหม่</li>
        <li><b>ภาคตะวันออกเฉียงเหนือ</b> วันที่ 11 กันยายน 2559 โดยมหาวิทยาลัยขอนแก่น</li>
        <li><b>ภาคใต้</b> วันที่ 10 กันยายน 2559 โดย มหาวิทยาลัยราชภัฏสงขลา</li>
        <li><b>ภาคกลาง เขต 1</b> วันที่ 11 กันยายน 2559 โดยจุฬาลงกรณ์มหาวิทยาลัย</li>
        <li><b>ภาคกลาง เขต 2</b> วันที่ 11 กันยายน 2559 โดย มหาวิทยาลัยมหิดล</li>
    </ul>
    <li><b>การแข่งขัน Thailand First Round Online</b> วันที่ 18 กันยายน 2559 โดย มหาวิทยาลัยมหาสารคาม</li>
    <li><b>การแข่งขัน Asia Thailand National On-site</b> วันที่ 17-18 ตุลาคม 2559 โดยมหาวิทยาลัยมหาสารคาม</li>
    <li><b>การแข่งขัน Asia Bangkok Regional Contest</b> วันที่ 10-11 พฤศจิกายน 2559 โดยจุฬาลงกรณ์มหาวิทยาลัย</li>
</ul>

<h3>วัตถุประสงค์</h3>
<ul>
    <li>เพื่อส่งเสริมการสร้างทักษะ ความสามารถในการเขียนโปรแกรม ความรู้ด้าน Algorithms ของนิสิต นักศึกษา</li>
    <li>เพื่อสร้างกิจกรรมทางวิชาการด้านเทคโนโลยีคอมพิวเตอร์สำหรับมหาวิทยาลัยและประเทศไทย</li>
    <li>เพื่อเป็นเวทีในการสร้างนักเขียนโปรแกรมรุ่นใหม่ของประเทศที่มีคุณภาพ ป้อนเข้าสู่อุตสาหกรรมซอฟต์แวร์</li>
    <li>เพื่อเตรียมตัว และยกระดับความสามารถ ในการไปแข่งในระดับนานาชาติ เพิ่มโอกาสเข้าสู่รอบ World Final</li>
</ul>