<h3>เกี่ยวกับ ACM-ICPC</h3>
<p>
    <b>ACM International Collegiate Programming Contest (ACM-ICPC)</b> เป็นการแข่งขันการเขียนโปรแกรมสำหรับอุดมศึกษาในระดับนานาชาติที่มีชื่อเสียงที่สุด โดยแต่ละทีมจะประกอบด้วยผู้แข่งขันสามคนและจะต้องเขียนโปรแกรมแก้ไขปัญหาทางวิทยาศาสตร์ คณิตศาสตร์ และอัลกอริทึม ภายในเวลาที่กำหนด จำนวนปัญหา 8-11 ข้อ ภายในเวลา 3 หรือ 5 ชั่วโมง โดยมีคอมพิวเตอร์หนึ่งเครื่อง ในประเทศไทยได้เริ่มมีการจัดการแข่งขันขึ้นครั้งแรกในปี ค.ศ. 2009 และในปีนี้ การแข่งขันที่จัดขึ้นในประเทศไทยประกอบด้วย
</p>
<ul>
    <li>การแข่งขันในระดับภูมิภาค</li>
    <ul>
        <li><b>ภาคเหนือ</b> วันที่ 6 กันยายน 2558 โดย มหาวิทยาลัยเชียงใหม่</li>
        <li><b>ภาคตะวันออกเฉียงเหนือ</b> วันที่ 13 กันยายน 2558 โดย มหาวิทยาลัยขอนแก่น</li>
        <li><b>ภาคกลาง A</b> วันที่ 13 กันยายน 2558 โดย มหาวิทยาลัยเกษตรศาสตร์ ศรีราชา</li>
        <li><b>ภาคกลาง B</b> วันที่ 12 กันยายน 2558 โดย จุฬาลงกรณ์มหาวิทยาลัย</li>
        <li><b>ภาคใต้</b> วันที่ 13 กันยายน 2558 โดย มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตหาดใหญ่</li>
    </ul>
    <li><b>การแข่งขัน Thailand First Round Online</b> วันที่ 19 กันยายน 2558 โดย มหาวิทยาลัยมหิดล</li>
    <li><b>การแข่งขัน Asia Thailand National On-site</b> วันที่ 22-23 ตุลาคม 2558 โดย มหาวิทยาลัยมหิดล</li>
    <li><b>การแข่งขัน Asia Bangkok Regional Contest</b> วันที่ 19-20 พฤศจิกายน 2558 โดย มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต</li>
</ul>

<h3>วัตถุประสงค์</h3>
<ul>
    <li>เพื่อส่งเสริมการสร้างทักษะ ความสามารถในการเขียนโปรแกรม ความรู้ด้าน Algorithms ของนิสิต นักศึกษา</li>
    <li>เพื่อสร้างกิจกรรมทางวิชาการด้านเทคโนโลยีคอมพิวเตอร์สำหรับมหาวิทยาลัยและประเทศไทย</li>
    <li>เพื่อเป็นเวทีในการสร้างนักเขียนโปรแกรมรุ่นใหม่ของประเทศที่มีคุณภาพ ป้อนเข้าสู่อุตสาหกรรมซอฟต์แวร์</li>
    <li>เพื่อเตรียมตัว และยกระดับความสามารถ ในการไปแข่งในระดับนานาชาติ เพิ่มโอกาสเข้าสู่รอบ World Final</li>
</ul>