<h3>รางวัล</h3>
<p>รางวัลสำหรับการแข่งขันมีดังต่อไปนี้</p>
<ul>
    <li><b>รางวัลที่ 1</b> จำนวน 1 รางวัล รางวัลละ 25,000 บาท</li>
    <li><b>รางวัลที่ 2</b> จำนวน 1 รางวัล รางวัลละ 20,000 บาท</li>
    <li><b>รางวัลที่ 3</b> จำนวน 1 รางวัล รางวัลละ 15,000 บาท</li>
    <li><b>รางวัลชมเชย</b> จำนวน 2 รางวัล รางวัลละ 10,000 บาท</li>
    <li><b>รางวัลพิเศษ</b> จำนวน 3 รางวัล รางวัลละ 3,000 บาท</li>
    <li><b>รางวัลสนับสนุนเข้าร่วมแข่งขัน ACM-ICPC ระดับประเทศไทย</b> สำหรับทีมอันดับ 1-10 ทีมละ 6,000 บาท</li>
</ul>

<h4>หมายเหตุ</h4>
<ul>
    <li>ทีมที่ได้รับรางวัลจะต้องเข้าร่วมการแข่งขัน ACM-ICPC Thailand 2015</li>
    <li>ทุกทีมที่ได้รับรางวัลจะได้การยกเว้นค่าลงทะเบียนการแข่งขัน ACM-ICPC Thailand 2015</li>
</ul>