<h3>กำหนดการรับสมัคร</h3>
<ul>
    <li><b>สมัครอบรมเตรียมความพร้อม</b> ภายในวันพุธที่ 24 สิงหาคม 2559</li>
    <li><b>สมัครเข้าร่วมแข่งขัน</b> ภายใน<del>วันศุกร์ที่ 26 สิงหาคม 2559</del> วันศุกร์ที่ 2 กันยายน 2559</li>
</ul>

<h3>Schedule</h3>
<p>กำหนดการแข่งขัน ACM-ICPC Thailand ระดับภูมิภาค ภาคกลาง เขต 1 ประจำปี 2559</p>
<p>วันอาทิตย์ที่ 11 กันยายน 2559</p>

<table class="table table-bordered">
    <tr class="table-header">
        <th>เวลา</th>
        <th>กิจกรรม</th>
    </tr>
    <tr>
        <td>08.30 - 09.00</td>
        <td>ลงทะเบียน</td>
    </tr>
    <tr>
        <td>09.00 - 09.30</td>
        <td>พิธีเปิดการแข่งขัน</td>
    </tr>
    <tr>
        <td>09.30 - 10.00</td>
        <td>ชี้แจงกำหนดการและขั้นตอนในการแข่งขัน</td>
    </tr>
    <tr>
        <td>10.00 - 10.20</td>
        <td>พักรับประทานอาหารว่าง</td>
    </tr>
    <tr>
        <td>10.20 - 11.40</td>
        <td>ตรวจสอบอุปกรณ์และทดลองใช้ระบบในลักษณะเหมือนแข่งจริง</td>
    </tr>
    <tr>
        <td>11.40 - 12.40</td>
        <td>รับประทานอาหารกลางวัน</td>
    </tr>
    <tr>
        <td>12.40 - 13.00</td>
        <td>ผู้เข้าร่วมแข่งขันประจำที่เพื่อเตรียมความพร้อม</td>
    </tr>
    <tr>
        <td>13.00 - 16.00</td>
        <td>เริ่มการแข่งขัน – สิ้นสุดการแข่งขัน</td>
    </tr>
    <tr>
        <td>16.00 - 16.30</td>
        <td>พักรับประทานอาหารว่าง</td>
    </tr>
    <tr>
        <td>16.30 – 17.30</td>
        <td>บรรยายโจทย์การแข่งขันและเฉลยวิธีการแก้ปัญหา</td>
    </tr>
    <tr>
        <td></td>
        <td>พิธีปิดการแข่งขัน ประกาศผลการแข่งขันอย่างเป็นทางการและมอบรางวัล</td>
    </tr>
</table>
